{
  "basics": {
    "name": "Yunyi Shang",
    "email": "winnyshang@gmail.com",
    "phone": "+86 137 9898 8355",
    "website": "https://winny-shang.github.io/"
  },
  "interests": ["Natural Language Processing", "Computer Vision", "Human-Computer Interaction", "Cognitive computing", "Reinforcement Learning"],
  "education": [
    {
      "institution": "Macau University of Science and Technology",
      "location": "Macau, China",
      "area": "Computer and Information Systems",
      "studyType": "(Master of Science)",
      "startDate": "2018",
      "endDate": "2020",
      "score": "GPA: 3.97/4.0, Rank: top 1%",
      "courses": [
        "Data Warehouse and Data Mining A+",
        "Software Engineering A",
        "Research Methods in Information Technology A+",
        "Computer Architecture A+"
      ]
    },
    {
      "institution": "Beijing Normal University, Zhuhai",
      "location": "Zhuhai, China",
      "area": "Computer Science and Technology",
      "studyType": "(Bachelor of Engineering)",
      "startDate": "2014",
      "endDate": "2018",
      "score": "GPA: 90/100, Rank: top 1%",
      "courses": [
        "Discrete Mathematics 94/100",
        "Data Structure 95/100",
        "Operating System 92/100",
        "Compiling Principle 96/100",
        "Probability and Mathematical Statistics 91/100"
      ]
    }
  ],
  "publications": [
    {
      "name": "Automatic Portrait Image Pixelization",
      "releaseDate": "2021-01",
      "url": "https://doi.org/10.1016/j.cag.2021.01.008",
      "supervisor": "Supervised by Prof. Hon-Cheng Wong",
      "objective": "Maintaining sharp boundaries in low-resolution while using a limited color range to convey the image content.",
      "highlights": [
        "Extracted portrait features using the Cascade Object Detection algorithm.",
        "Abstractly represented images through non-uniform five-dimensional clustering, considering spatial and color aspects, based on pixel art characteristics. Algorithms used: SLIC Superpixels, FISODATA.",
        "Enhanced image effects using algorithms such as Gaussian Bilateral Filtering, Sobel Edge Detection and Morphological Algorithms."
      ],
      "summary": "By combining the strengths of existing methods, a novel approach is proposed for automatic pixelated image generation. This method incorporates image downscaling techniques and color gradient extraction methods to enhance visual effects and meet the aesthetic requirements of pixel art."
    },
    {
      "name": "Improved Viola-Jones face detection algorithm under the HoloLens headset",
      "releaseDate": "2019-02",
      "url": "https://doi.org/10.1186/s13640-019-0435-6",
      "supervisor": "Supervised by Prof. Jing Huang",
      "objective": "Hololens Device-Based Facial Detection for Real-Time Applications. Compared to existing face detection interfaces, the accuracy has increased by 12%, and the detection speed has improved fourfold.",
      "highlights": [
        "Boosted the detection speed of the classic Viola-Jones face detection algorithm using two-dimensional convolution separation.",
        "Optimized detection speed in the application by leveraging image resampling techniques with Microsoft's mixed reality headset, HoloLens.",
        "Leveraged SLAM (Simultaneous Localization and Mapping) technology for 3D positioning, enabling better human-computer interaction effects through gesture interaction."
      ],
      "summary": "Compared to existing face detection interfaces, the accuracy has increased by 12%, and the detection speed has improved fourfold."
    }
  ],
  "work": [
    {
      "name": "Tencent Technology (Shenzhen) Co., Ltd",
      "location": "Shenzhen, China",
      "position": "Applied Researcher",
      "startDate": "2020",
      "endDate": "2022",
      "highlights": [
        "Led the development and implementation of DevOps algorithms for engineering efficiency, facilitating industrialized processing of user feedback to enhance efficiency and manpower allocation.",
        "Research projects included intelligent classification of feedback text, log anomaly detection, high-frequency feedback alerting, invalid feedback filtering, and mutation testing algorithms.",
        "Expertise in machine learning and deep learning algorithms in natural language processing and computer vision domains, with a focus on rapid paper reproduction and application integration using data cleaning, data augmentation, and few-shot learning techniques."
      ]
    }
  ],
  "intern": [
    {
      "name": "Tencent Technology (Shenzhen) Co., Ltd",
      "location": "Shenzhen, China",
      "position": "Data Analysis and Backend Development",
      "startDate": "2020.06",
      "endDate": "08",
      "highlights": [
        "Led the development of feedback preprocessing services for the platform, encompassing text similarity and image similarity, completing background research, solution formulation, algorithm prototyping, technical documentation, and requirement reviews.",
        "Managed data statistics services, filtering and analyzing invalid and known issues, conducting root cause analysis for resolved problems, and optimizing rejected issues."
      ]
    }
  ],
  "projects": [
    {
      "name": "Intelligent Classification of Feedback Text",
      "summary": "The project employs a cascaded approach, combining machine learning and deep learning models, to achieve multi-level classification of feedback text. It involves algorithm development and optimization from scratch to completion.",
      "startDate": "2021.01",
      "endDate": "09"
    },
    {
      "name": "Log Anomaly Detection",
      "summary": "Combine online analysis capabilities and anomaly detection algorithms to provide a generalized solution for problem analysis, prediction, and recommendation. This improves problem localization efficiency for businesses.",
      "startDate": "2021.09",
      "endDate": "22.06"
    },
    {
      "name": "High-Frequency Feedback Alert System Reconstruction",
      "summary": "Reconstruct and upgrade an outdated project to monitor newly emerging hotspots in user feedback in real-time by employing condition filtering, threshold judgment, fluctuation detection, and algorithm mining of high-frequency words.",
      "startDate": "2021.05",
      "endDate": "11"
    },
    {
      "name": "Feedback Information Preprocessing",
      "summary": "Achieved a 65% reduction in repetitive issues, increased duplicate detection rate by 122%, and optimized the input-output ratio of feedback problems",
      "startDate": "2020.06",
      "endDate": "08"
    },
    {
      "name": "Data Statistics",
      "summary": "Transitioned from 2 person-days of offline statistics to real-time statistics, improving accuracy and generating traceable source data.",
      "startDate": "2020.07",
      "endDate": "08"
    }
  ],
  "patents": [
    {
      "name": "A feedback information classification method, apparatus, electronic device, and storage medium.",
      "releaseDate": "2022",
      "number": "CN2022103576915"
    },
    {
      "name": "Training method, detection method, and apparatus for a log detection model.",
      "releaseDate": "2023",
      "number": "CN2022115234904"
    }
  ],
  "skills": [
    {
      "name": "Programming Languages",
      "icon": "fa-solid fa-hashtag",
      "keywords": ["C, C++, C#, Python, Java, Golang, Matlab"]
    },
    {
      "name": "Machine Learning/Deep learning",
      "icon": "fa-solid fa-hashtag",
      "keywords": ["PyTorch, TensorFlow, Scikit-Learn"]
    },
    {
      "name": "Framework",
      "icon": "fa-solid fa-hashtag",
      "keywords": ["Remote Procedure Call(RPC)", "Model View Controller(MVC)", "Domain-Driven Design(DDD)"]
    },
    {
      "name": "Database",
      "icon": "fa-solid fa-hashtag",
      "keywords": ["MySQL", "Redis", "MongoDB"]
    },
    {
      "name": "Others",
      "icon": "fa-solid fa-hashtag",
      "keywords": ["Android Studio", "Unity"]
    }
  ],
  "teaching": [
    {
      "name": "Computer Graphics",
      "courseDate": "2019 Fall",
      "description": "Teaching assistant"
    },
    {
      "name": "Discrete Mathematics",
      "courseDate": "2019 Spring",
      "description": "Grader"
    },
    {
      "name": "Data Structure",
      "courseDate": "2018 Fall",
      "description": "Grader"
    },
    {
      "name": "Computer Graphics",
      "courseDate": "2018 Spring",
      "description": "Teaching assistant"
    },
    {
      "name": "Computer Graphics",
      "courseDate": "2017 Fall",
      "description": "Teaching assistant"
    },
    {
      "name": "Principles of Computer Organization Practice",
      "courseDate": "2017 Spring",
      "description": "Teaching assistant"
    },
    {
      "name": "Principles of Computer Organization Practice",
      "courseDate": "2016 Fall",
      "description": "Teaching assistant"
    },
    {
      "name": "C programming",
      "courseDate": "2016 Spring",
      "description": "Grader"
    },
    {
      "name": "C programming",
      "courseDate": "2015 Fall",
      "description": "Grader"
    }
  ],
  "awards": [
    {
      "title": "Graduate Scholarship",
      "date": "2018-2020",
      "awarder": "awarded by Macau University of Science and Technology",
      "summary": "50% tuition fee waiver"
    },
    {
      "title": "Outstanding Academic Scholarship",
      "date": "2015,2016,2017",
      "awarder": "awarded by Beijing Normal University, Zhuhai",
      "summary": "Ranking: 1.50%"
    },
    {
      "title": "Third Prize in the Guangdong Provincial College Computer Works Competition",
      "date": "2018.06",
      "awarder": "awarded by the Guangdong Computer Society"
    },
    {
      "title": "Outstanding Graduate",
      "date": "2018.06",
      "awarder": "awarded by Beijing Normal University, Zhuhai"
    },
    {
      "title": "Outstanding Graduation Thesis",
      "date": "2018.06",
      "awarder": "awarded by Beijing Normal University, Zhuhai"
    },

    {
      "title": "IT Festival Second Prize",
      "date": "2018",
      "awarder": "awarded by Beijing Normal University, Zhuhai"
    },
    {
      "title": "ACM Programming Contest Excellence Award",
      "date": "2016",
      "awarder": "awarded by Beijing Normal University, Zhuhai"
    },
    {
      "title": "Excellent Community Work Award",
      "date": "2015,2016,2017",
      "awarder": "awarded by Beijing Normal University, Zhuhai"
    },
    {
      "title": "Outstanding Peer Mentor",
      "date": "2016.10",
      "awarder": "awarded by Beijing Normal University, Zhuhai"
    }
  ],
  "extracurricular": [
    {
      "name": "BNU High Tech Team",
      "position": "Team Leader",
      "startDate": "2017",
      "endDate": "2018",
      "description": "The team is dedicated to the research, development, and demonstration of virtual reality technologies such as HoloLens, HTC VIVE, Oculus, 3D printing, mobile VR/AR, and XBOX.",
      "highlights": [
        "Coordinated and communicated with team members to organize and supervise work plans.",
        "Led several projects, including an AR map navigation system based on iOS (national), a VR fire simulation project (national), a unique 3D printing initiative (provincial), an HTC-based smart home system (university), and an AR word recognition card based on the Android system (commercial).",
        "Running a VR experience store for the public and popularizing XR technology for non-specialized students."
      ]
    },
    {
      "name": "Community Service",
      "position": "Lead Organizer",
      "startDate": "2015",
      "endDate": "2017",
      "highlights": [
        "Conducted activities such as assisting seniors with smartphone usage, educating elementary students on internet resources and safety, providing academic support to teenagers, engaging in community gardening projects.",
        "Leverage the professional advantages of our information technology education, narrowing the cognitive gap between different age groups and fostering mutual assistance and communication within the community.",
        "Led a research project on the integration of information technology education in social service. Explored ways to improve content and organization of university social service projects."
      ]
    },
    {
      "name": "School of Information Technology Students' Union",
      "position": "Director of Public Relations",
      "startDate": "2015",
      "endDate": "2016",
      "highlights": [
        "Actively pursued and secured sponsorships for various events and activities, successfully obtaining the necessary financial support and resources to enhance the quality and impact of student initiatives.",
        "Demonstrated strong organizational and communication skills in effectively managing the official public WeChat account of the Students' Union. Regularly published engaging and informative content, attracting a large following and increasing visibility for the organization.",
        "Took on the responsibility of organizing the Student Representative Assembly, a significant gathering of student representatives. Oversaw the logistical aspects of the event, including venue arrangement, scheduling, and coordinating with participants. Fostered an inclusive and productive environment for open discussions, ensuring that student voices were heard and valuable feedback was shared."
      ]
    },
    {
      "name": "Peer Mentor",
      "description": "Provided guidance to first-year students in academic and personal aspects.",
      "startDate": "2015",
      "endDate": "2016",
      "highlights": [
        "Assisted in course selection, study strategies, and time management. Facilitated the integration of new students into the academic environment.",
        "Addressed various aspects of student life, including campus culture and resource utilization.",
        "Organized social events to foster a sense of community among freshmen. "
      ]
    },
    {
      "name": "Debate Team",
      "startDate": "2014",
      "endDate": "2016",
      "highlights": [
        "Selected as a member of the university-level debate team during freshman year.",
        "Promoted to the position of the college debate team coach in sophomore year. Guided and mentored debaters, emphasizing teamwork and critical thinking.",
        "Contributed for three consecutive years to the organization of the International Chinese Debate Championship, ensuring a platform for debaters worldwide to engage in meaningful exchanges of ideas and perspectives."
      ]
    },
    {
      "name": "Class Monitor",
      "startDate": "2014",
      "endDate": "2018",
      "highlights": [
        "Coordinated class activities and facilitated communication between students and faculty.",
        "Successfully elected as a major leader. Represented the interests and concerns of peers within the academic discipline.",
        "Engaged in decision-making processes and collaborated with faculty members."
      ]
    }
  ],
  "activities": [
    {
      "name": "Summer Programs",
      "activityDate": "2016",
      "location": "Australia",
      "description": "at Monash University and Macquarie University",
      "highlights": [
        "Being selected for the School Education Development Fund",
        "Attained High Distinction(HD) in coursework during international programs. Demonstrated dedication to rigorous study and success in a competitive academic setting."
      ]
    },
    {
      "name": "International Student Volunteer",
      "activityDate": "2017",
      "location": "Los Angeles, USA",
      "description": "at SIGGRAPH2017",
      "highlights": [
        "Engaged in diverse volunteer responsibilities, including event logistics and attendee interactions.",
        "Immersed in the world of computer graphics, interactive techniques, and emerging technologies. Witnessed cutting-edge advancements in the field."
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Fluent",
      "icon": ""
    },
    {
      "language": "Mandarin and Cantonese",
      "fluency": "Native speaker",
      "icon": ""
    }
  ]
}
